<a href="https://colab.research.google.com/github/willis1116/Tibame_Machine-Learning/blob/main/1124_titanic.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
from urllib.request import urlretrieve
import pandas as pd 
url = "https://github.com/Elwing-Chou/tibaml1027/raw/main/train.csv"
urlretrieve(url, "train.csv")
data = pd.read_csv("train.csv", encoding="utf-8")
url = "https://github.com/Elwing-Chou/tibaml1027/raw/main/test.csv"
urlretrieve(url, "test.csv")
predict = pd.read_csv("test.csv", encoding="utf-8")

In [2]:
df = pd.concat([data, predict], axis=0, ignore_index=True)
df = df.drop(["PassengerId", "Survived"], axis=1) 
df

      Pclass                                               Name  ... Cabin  Embarked
0          3                            Braund, Mr. Owen Harris  ...   NaN         S
1          1  Cumings, Mrs. John Bradley (Florence Briggs Th...  ...   C85         C
2          3                             Heikkinen, Miss. Laina  ...   NaN         S
3          1       Futrelle, Mrs. Jacques Heath (Lily May Peel)  ...  C123         S
4          3                           Allen, Mr. William Henry  ...   NaN         S
...      ...                                                ...  ...   ...       ...
1304       3                                 Spector, Mr. Woolf  ...   NaN         S
1305       1                       Oliva y Ocana, Dona. Fermina  ...  C105         C
1306       3                       Saether, Mr. Simon Sivertsen  ...   NaN         S
1307       3                                Ware, Mr. Frederick  ...   NaN         S
1308       3                           Peter, Master. Michael J  ...   NaN         C

[1309 rows x 10 columns]

In [3]:
def cabin(c):
  if not pd.isna(c):
    return c[0]
  else:
    return None
df["Cabin"] = df["Cabin"].apply(cabin)
df

      Pclass                                               Name  ... Cabin  Embarked
0          3                            Braund, Mr. Owen Harris  ...  None         S
1          1  Cumings, Mrs. John Bradley (Florence Briggs Th...  ...     C         C
2          3                             Heikkinen, Miss. Laina  ...  None         S
3          1       Futrelle, Mrs. Jacques Heath (Lily May Peel)  ...     C         S
4          3                           Allen, Mr. William Henry  ...  None         S
...      ...                                                ...  ...   ...       ...
1304       3                                 Spector, Mr. Woolf  ...  None         S
1305       1                       Oliva y Ocana, Dona. Fermina  ...     C         C
1306       3                       Saether, Mr. Simon Sivertsen  ...  None         S
1307       3                                Ware, Mr. Frederick  ...  None         S
1308       3                           Peter, Master. Michael J  ...  None         C

[1309 rows x 10 columns]

In [4]:
dic = df["Ticket"].value_counts()
df["Ticket"] = df["Ticket"].replace(dic)
#替換成此張票號有幾人擁有

In [5]:
def name(n):
  n = n.split(",")[-1].split(".")[0]
  n = n.strip()
  return n
df["Name"] = df["Name"].apply(name)
#取中間稱謂能找出這個人有沒有已婚
df

      Pclass    Name     Sex   Age  ...  Ticket      Fare  Cabin  Embarked
0          3      Mr    male  22.0  ...       1    7.2500   None         S
1          1     Mrs  female  38.0  ...       2   71.2833      C         C
2          3    Miss  female  26.0  ...       1    7.9250   None         S
3          1     Mrs  female  35.0  ...       2   53.1000      C         S
4          3      Mr    male  35.0  ...       1    8.0500   None         S
...      ...     ...     ...   ...  ...     ...       ...    ...       ...
1304       3      Mr    male   NaN  ...       1    8.0500   None         S
1305       1    Dona  female  39.0  ...       3  108.9000      C         C
1306       3      Mr    male  38.5  ...       1    7.2500   None         S
1307       3      Mr    male   NaN  ...       1    8.0500   None         S
1308       3  Master    male   NaN  ...       3   22.3583   None         C

[1309 rows x 10 columns]

In [6]:
def isna_sum(df_):
  nasum = df.isna().sum()
  # 篩選: Series[跟你資料筆數一樣多的T/F]
  result = nasum[nasum>0].sort_values(ascending=False)
  print(result)

In [7]:
med = df.median().drop(["Pclass"])
df = df.fillna(med)
isna_sum(df)

Cabin       1014
Embarked       2
dtype: int64

In [8]:
most = df["Embarked"].value_counts().idxmax()
df["Embarked"] = df["Embarked"].fillna(most)
isna_sum(df)

Cabin    1014
dtype: int64

In [9]:
nc = df["Name"].value_counts()
whitelist = nc[nc > 50].index
def name_mid(n):
  if n not in whitelist:
    return None
  else:
    return n
df["Name"] = df["Name"].apply(name_mid)

In [10]:
df = pd.get_dummies(df)
df = pd.get_dummies(df, columns=["Pclass"])
df

       Age  SibSp  Parch  Ticket  ...  Embarked_S  Pclass_1  Pclass_2  Pclass_3
0     22.0      1      0       1  ...           1         0         0         1
1     38.0      1      0       2  ...           0         1         0         0
2     26.0      0      0       1  ...           1         0         0         1
3     35.0      1      0       2  ...           1         1         0         0
4     35.0      0      0       1  ...           1         0         0         1
...    ...    ...    ...     ...  ...         ...       ...       ...       ...
1304  28.0      0      0       1  ...           1         0         0         1
1305  39.0      0      0       3  ...           0         1         0         0
1306  38.5      0      0       1  ...           1         0         0         1
1307  28.0      0      0       1  ...           1         0         0         1
1308  28.0      1      1       3  ...           0         0         0         1

[1309 rows x 25 columns]

In [11]:
df["Family"] = df["SibSp"] + df["Parch"]
df

       Age  SibSp  Parch  Ticket  ...  Pclass_1  Pclass_2  Pclass_3  Family
0     22.0      1      0       1  ...         0         0         1       1
1     38.0      1      0       2  ...         1         0         0       1
2     26.0      0      0       1  ...         0         0         1       0
3     35.0      1      0       2  ...         1         0         0       1
4     35.0      0      0       1  ...         0         0         1       0
...    ...    ...    ...     ...  ...       ...       ...       ...     ...
1304  28.0      0      0       1  ...         0         0         1       0
1305  39.0      0      0       3  ...         1         0         0       0
1306  38.5      0      0       1  ...         0         0         1       0
1307  28.0      0      0       1  ...         0         0         1       0
1308  28.0      1      1       3  ...         0         0         1       2

[1309 rows x 26 columns]

In [12]:
#loc[列標籤], iloc[第幾列]
import numpy as np
x = df.iloc[:data.shape[0]]
x = np.array(x)
x_predict = df.iloc[data.shape[0]:]
x_predict = np.array(x_predict)
y = np.array(data["Survived"])

In [13]:
#全部都試過看哪一組參數較好
from sklearn.ensemble import RandomForestClassifier
from sklearn.model_selection import GridSearchCV
clf = RandomForestClassifier()
params = {
    "max_depth":range(5, 10),
    "n_estimators":range(21, 100, 2)
}
search = GridSearchCV(clf, params, cv=10, n_jobs=-1)
search.fit(x,y)
print(search.best_score_)
print(search.best_params_)

0.8417727840199751
{'max_depth': 7, 'n_estimators': 75}

In [18]:
from sklearn.model_selection import cross_val_score
clf = RandomForestClassifier(max_depth=8,
                n_estimators=43)
clf.fit(x, y)
scores = cross_val_score(clf, x, y, cv=10, n_jobs=-1)
print(scores)
print(np.average(scores))
pre = clf.predict(x_predict)
result = pd.DataFrame({
    "PassengerId":predict["PassengerId"],
    "Survived":pre
})
result.to_csv("rf.csv", encoding="utf-8", index=False)
result

[0.8        0.85393258 0.74157303 0.8988764  0.8988764  0.84269663
 0.83146067 0.76404494 0.85393258 0.83146067]
0.8316853932584269

     PassengerId  Survived
0            892         0
1            893         0
2            894         0
3            895         0
4            896         1
..           ...       ...
413         1305         0
414         1306         1
415         1307         0
416         1308         0
417         1309         1

[418 rows x 2 columns]

In [15]:
# loc[列標籤], iloc[第幾列]
from sklearn.preprocessing import MinMaxScaler
scaler = MinMaxScaler()
df_scale = scaler.fit_transform(df)
x_scale = df_scale[:data.shape[0]]
x_predict_scale = df_scale[data.shape[0]:]
y = np.array(data["Survived"])
pd.DataFrame(x_scale)

           0      1         2    3         4   ...   21   22   23   24   25
0    0.273456  0.125  0.000000  0.0  0.014151  ...  1.0  0.0  0.0  1.0  0.1
1    0.473882  0.125  0.000000  0.1  0.139136  ...  0.0  1.0  0.0  0.0  0.1
2    0.323563  0.000  0.000000  0.0  0.015469  ...  1.0  0.0  0.0  1.0  0.0
3    0.436302  0.125  0.000000  0.1  0.103644  ...  1.0  1.0  0.0  0.0  0.1
4    0.436302  0.000  0.000000  0.0  0.015713  ...  1.0  0.0  0.0  1.0  0.0
..        ...    ...       ...  ...       ...  ...  ...  ...  ...  ...  ...
886  0.336089  0.000  0.000000  0.0  0.025374  ...  1.0  0.0  1.0  0.0  0.0
887  0.235876  0.000  0.000000  0.0  0.058556  ...  1.0  1.0  0.0  0.0  0.0
888  0.348616  0.125  0.222222  0.3  0.045771  ...  1.0  0.0  0.0  1.0  0.3
889  0.323563  0.000  0.000000  0.0  0.058556  ...  0.0  1.0  0.0  0.0  0.0
890  0.398722  0.000  0.000000  0.0  0.015127  ...  0.0  0.0  0.0  1.0  0.0

[891 rows x 26 columns]

In [16]:
from sklearn.neighbors import KNeighborsClassifier
clf = KNeighborsClassifier()
params = {
    "n_neighbors":range(5, 100)
}
search = GridSearchCV(clf, params, cv=10, n_jobs=-1)
search.fit(x_scale,y)
print(search.best_score_)
print(search.best_params_)

0.832796504369538
{'n_neighbors': 7}

In [17]:
clf = KNeighborsClassifier(n_neighbors=11)
clf.fit(x_scale, y)
pre = clf.predict(x_predict_scale)
result = pd.DataFrame({
    "PassengerId":predict["PassengerId"],
    "Survived":pre
})
result.to_csv("Knn.csv", encoding="utf-8", index=False)
result

     PassengerId  Survived
0            892         0
1            893         1
2            894         0
3            895         0
4            896         1
..           ...       ...
413         1305         0
414         1306         1
415         1307         0
416         1308         0
417         1309         1

[418 rows x 2 columns]

In [23]:
pd.DataFrame({
    "Name":df.columns,
    "Imp":clf.feature_importances_
}).sort_values(by="Imp", ascending=False)

           Name       Imp
7       Name_Mr  0.142485
10     Sex_male  0.123699
9    Sex_female  0.122149
4          Fare  0.113582
0           Age  0.088664
3        Ticket  0.056158
24     Pclass_3  0.049876
22     Pclass_1  0.041346
25       Family  0.038949
1         SibSp  0.038434
6     Name_Miss  0.035120
8      Name_Mrs  0.031140
2         Parch  0.016609
5   Name_Master  0.015940
15      Cabin_E  0.015417
23     Pclass_2  0.014764
21   Embarked_S  0.013168
19   Embarked_C  0.012405
14      Cabin_D  0.007342
13      Cabin_C  0.006120
12      Cabin_B  0.006080
20   Embarked_Q  0.005909
11      Cabin_A  0.002099
17      Cabin_G  0.001187
16      Cabin_F  0.001064
18      Cabin_T  0.000295